In [5]:
import pandas as pd
import numpy as np

# PART 1

## Map function
### The syntax for map function is <font size="5">**map(function,iterables)**</font>
Map() is used for interating a function through a list. map() makes the function goes through the list one by one and gives the result that the function tells it to

In [6]:
def example(x): #syntax for creating a function def function name/variable(argument)
    if x%2==0:   
        # means that when x id divided by 2, it shouldn't have a remainder(also means the number is even)

        return x+2  # to add the argument by 2 if it's divisible by 2
    else:
        return x-2 # to subtract 2 from the argument if it's not divisible by 2

In [7]:
# Checking if the function works by calling the function and putting in 15 as the argument
example(15)

13

#### But what if you want to perform the function on a list

In [8]:
my_list=[2,3,4,5,6,12,33,43,45,56,20,30]
example(my_list)# it gives an error so what can be done? Worry not, that's where map() comes in

TypeError: unsupported operand type(s) for %: 'list' and 'int'

In [9]:
# map(function,iterable)
map(example,my_list) #gives it a map object location but to view it,we have to put it in a list
list(map(example,my_list)) # it goes through the list and performs the function one by one

[4, 1, 6, 3, 8, 14, 31, 41, 43, 58, 22, 32]

In [10]:
def mega(x):  # another example
    if x.startswith("R"):
        return x
    else:
        return "No"
mega("Paul")

'No'

In [12]:
names=["How","paul","Raul","raul","Rebecca","Rat"]
list(map(mega,names))

['No', 'No', 'Raul', 'No', 'Rebecca', 'Rat']

# Filter function for a list
### The syntax for filter function is <font size="5">**filter(function,iterables)**</font>
<font size="5">Filter function brings out any value that is true to the function</font>

In [13]:
# creating a new function
def link(x):
    if x%2==0:
        return x
link(20)

20

In [14]:
# using the map option
a=[2,3,4,5,6,20,233,435]
list(map(link,a))
#Creates a None object because i didn't specify what it should return if the number isn't divisible by 2

[2, None, 4, None, 6, 20, None, None]

 ### Now, notice what a filter does

In [15]:
#  filter(function,iterator)
filter(link,a) #creates a filter object location so we have to put it in a list to view

In [17]:
list(filter(link,a)) # it brings out all the number that is divisible by 2. That's what filter does. 
# It filters out all the numbers where the function is True
#That's why it filtered out only the number divisible by 2

[2, 4, 6, 20]

In [18]:
def another(x):  # another example
    if x.startswith("V"):
        return x

In [19]:
b=["Paul","Oludolapo","Precious","Victor","Garrett","Vannessa","Mark","Lea","Keith","Angel","Victoria"]
list(filter(another,b))

['Victor', 'Vannessa', 'Victoria']

 ### Lambda function
 1. Lambda is used similarly to how we create a function using def<br />
 1.  But Lambda is an anonymous function because it doesn't need a function variable<br />
 1.  The syntax for lambda function is **lambda argument/arguments: expression<br />**

In [20]:
def test(x,y,z):
    return x+y+z
test(2,3,4)

# This is a function created using def keyword but let's see how we can create the same using lambda

9

In [21]:
# lambda argument: expression
addition= lambda x,y,z:x+y+z #wrote the same function in just one line
# x,y,z is the argument while x+y+z is the expression
#addition is a variable containg the function
addition(2,3,4)

9

#### Another example

In [22]:
def just(x):
    if x==2:
        return x
    else:
        return x-2  
# if x is equal to 2, give back x else subtract 2 from the number
just(3) # 3 is not equal to 2 so 3-2 will give 1

1

In [23]:
b=lambda x: x if x==2 else x-2  # same code as above but shorter.

# x if x==2 else x-2 means that the result for the if statement will be behind the if statement
# while the result for else statement will be after else<n/>

b(20)

18

## Using apply(),map(),lambda(),filter() on Dataframe

In [24]:
data={"Name":["Paul","Oludolapo","Precious","Victor","Garrett","Victoria","Mark","Lea","Keith","Angel","Victoria"],
      "Age":np.random.randint(20,30,11),
      "Occupation":np.random.choice(("Engineer","Data Scientist","Medical Doctor","Geologist"),size=11)
     }
data=pd.DataFrame(data)
data

         Name  Age      Occupation
0        Paul   29  Medical Doctor
1   Oludolapo   22  Data Scientist
2    Precious   25  Data Scientist
3      Victor   26  Medical Doctor
4     Garrett   21  Medical Doctor
5    Victoria   24  Data Scientist
6        Mark   26  Medical Doctor
7         Lea   20  Medical Doctor
8       Keith   26       Geologist
9       Angel   28  Data Scientist
10   Victoria   21  Data Scientist

###### Explanation for above code
1. I created a dictionary<br /><br />
2. np.random.randint(20,30,11) means that numpy should produce 11 random integers from 20-30 as age<br /><br />
2. for np.random.choice means that i'm creating the words that should be random not numpy. so i gave it the occupation i wanted and size means that it should randomize them in 11 places<br /><br />
3. Then i converted it into a pandas dataframe by using pd.Dataframe() <br /><br />

In [25]:
data

         Name  Age      Occupation
0        Paul   29  Medical Doctor
1   Oludolapo   22  Data Scientist
2    Precious   25  Data Scientist
3      Victor   26  Medical Doctor
4     Garrett   21  Medical Doctor
5    Victoria   24  Data Scientist
6        Mark   26  Medical Doctor
7         Lea   20  Medical Doctor
8       Keith   26       Geologist
9       Angel   28  Data Scientist
10   Victoria   21  Data Scientist

## filter function on a dataframe
1. The filter function works in a different way on a dataframe
3. filter() can extract a particular row with all associated columns
3. filter() is ideal for extracting a particular column
3. The filter() always prints out in a dataframe format

#### In summary,  filter() only creates a subset of the rows and columns. Lets see some examples using te above data

In [26]:
def me(x):
    x>25
    return True
me(30)

True

From the first part of this notebook/ yesterday's tutorial, we are going to use the filter function syntax on the dataframe and we will see what happens

In [27]:
list(filter(me,data["Age"])) # trying to filter Age that's greater than 25 from the function above
# but you can see that it just prints out all the age column values and doesn't work as it should
# This is because we are working on a dataframe now and not a list

[29, 22, 25, 26, 21, 24, 26, 20, 26, 28, 21]

## The format in which it works on a dataframe
1. To extract a column or group of columns

In [ ]:
data

In [28]:
# 1. To extract a column or group of columns
# example 1
data.filter(["Age"])

    Age
0    29
1    22
2    25
3    26
4    21
5    24
6    26
7    20
8    26
9    28
10   21

In [29]:
data.filter(["Age","Occupation"])

    Age      Occupation
0    29  Medical Doctor
1    22  Data Scientist
2    25  Data Scientist
3    26  Medical Doctor
4    21  Medical Doctor
5    24  Data Scientist
6    26  Medical Doctor
7    20  Medical Doctor
8    26       Geologist
9    28  Data Scientist
10   21  Data Scientist

In [30]:
#example 2. To extract a specific row
data.filter(like="7",axis=0)
# like is like choosing the particular index you want and the index number is in string format
# axis=0 means that you are referring to the row

  Name  Age      Occupation
7  Lea   20  Medical Doctor

This is basically how the filter function works on pandas dataframe

## Map function on a dataframe
1. The map function only works on a series or a column
2. It is used for computation on a dataframe column
3. Note: It can't work on multiple columns.<br/> 
3. The best use of the map function can be observed with the lambda function
Let's dive straight in

In [31]:
data

         Name  Age      Occupation
0        Paul   29  Medical Doctor
1   Oludolapo   22  Data Scientist
2    Precious   25  Data Scientist
3      Victor   26  Medical Doctor
4     Garrett   21  Medical Doctor
5    Victoria   24  Data Scientist
6        Mark   26  Medical Doctor
7         Lea   20  Medical Doctor
8       Keith   26       Geologist
9       Angel   28  Data Scientist
10   Victoria   21  Data Scientist

In [32]:
# From the first part, we already know the syntax to creating a lambda function. pls refer back
data["Name"].map(lambda x:x if x.startswith("P") else "No")
# this is a lambda function that says that for every name that starts with P,the name should be print
#else it should print No. This syntax was already explained, pls check part 1 of this notebook

0         Paul
1           No
2     Precious
3           No
4           No
5           No
6           No
7           No
8           No
9           No
10          No
Name: Name, dtype: object

## Apply() is very versatile and works well with lambda for complex computations
1. it can be used to create new columns though there are other ways to also create new columns but apply() does much more complex computations.
df.apply(lambda x: func(x['col1'],x['col2']),axis=1)

Creating a new dataframe

In [33]:
movie={"Title":["Cinderella","Barbie","Terminator", "Spartacus","Main Hoon Na","Kuch Kuch Hota Hai","Power Rangers"],
      "Genre":np.random.choice(("Fantasy","Action","Thriller"),size=7),
      "Rating":np.random.randint(1,6,7),
      "No_of_ratings":np.random.randint(20,50,7) } #Just for example

movie_data=pd.DataFrame(movie) # converting the dictionary into a dataframe

In [34]:
movie_data

                Title     Genre  Rating  No_of_ratings
0          Cinderella    Action       3             24
1              Barbie   Fantasy       1             31
2          Terminator  Thriller       1             36
3           Spartacus    Action       2             31
4        Main Hoon Na   Fantasy       5             46
5  Kuch Kuch Hota Hai   Fantasy       3             40
6       Power Rangers    Action       4             22

In [35]:
# example 1
# Create a column for the total rating gotten on each genre

movie_data["Total Rating"]=movie_data["Rating"]*movie_data["No_of_ratings"]

In [36]:
movie_data
## yay!!!!, we did it without using apply but what if you encounter a more tougher and logical computation

                Title     Genre  Rating  No_of_ratings  Total Rating
0          Cinderella    Action       3             24            72
1              Barbie   Fantasy       1             31            31
2          Terminator  Thriller       1             36            36
3           Spartacus    Action       2             31            62
4        Main Hoon Na   Fantasy       5             46           230
5  Kuch Kuch Hota Hai   Fantasy       3             40           120
6       Power Rangers    Action       4             22            88

Example 2 is inspired from https://towardsdatascience.com/apply-and-lambda-usage-in-pandas-b13a1ea037f7#:~:text=%20Apply%20and%20Lambda%20usage%20in%20pandas%20,don%E2%80%99t%20want%20to%20remember%20the%20syntax...%20More%20

Create a new column for a custom rating. The column should follow the following conditions
1. If the movie is of the thriller genre,Add 1 to the  total rating **only if** Total Rating remains less than or equal to 100.If the Total Rating is above 100, make sure to create a condition that will change it back to 100
1. And If a movie is a Action,subtract 1 from the rating.

In [37]:
def custom_rating(genre,rating): 
    if 'Thriller' in genre:
        return min(100,rating+1)#Add 1 if rating is not greater than 100 and if greater than 100,return 100
    elif 'Action' in genre:
        return max(0,rating-1) # there's no max value so subtract rating by 0
    else:
        return rating #return rating for other genre
        
movie_data['CustomRating'] = movie_data.apply(lambda x: custom_rating(x['Genre'],x['Total Rating']),axis=1)

In [38]:
movie_data

,Title,Genre,Rating,No_of_ratings,Total Rating,CustomRating
0,Cinderella,Action,3,24,72,71
1,Barbie,Fantasy,1,31,31,31
2,Terminator,Thriller,1,36,36,37
3,Spartacus,Action,2,31,62,61
4,Main Hoon Na,Fantasy,5,46,230,230
5,Kuch Kuch Hota Hai,Fantasy,3,40,120,120
6,Power Rangers,Action,4,22,88,87

Just go through it slowly

In [39]:
# Let's try using map function for the same function
movie_data['CustomRating'] = movie_data.map(lambda x: custom_rating(x['Genre'],x['Total Rating']),axis=1)
#It gives an error which shows the superiority of apply()

AttributeError: 'DataFrame' object has no attribute 'map'

I hope this cleared any confusion. If you have any question, don't hesitate to send me a message. Thanks